{
  "peft_type": "HIRA",
  "task_type": "SEQ_CLS",
  "base_model_name_or_path": "distilbert-base-uncased",
  "inference_mode": false,
  "r": 16,
  "alpha": 16,
  "dropout": 0.0,
  "target_modules": [
    "q_lin",
    "k_lin",
    "v_lin",
    "out_lin"
  ],
  "bias": "none",
  "l1_lambda": 0.0,
  "prune_ratio": 0.0
}